## MATPLOTLIB

In [47]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

## LOAD DATA SET

In [8]:
## load car loan data set in to dataframe
filename = 'data/table_i702t60.csv'
df = pd.read_csv(filename)

In [9]:
## veiw the first five row
df.head()

,Unnamed: 0,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,interest_rate,car_type
0,0,1,34689.96,687.23,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,1,2,34205.66,687.23,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,2,3,33718.53,687.23,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,3,4,33228.55,687.23,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,4,5,32735.70,687.23,191.50,495.73,32239.97,0.0702,Toyota Sienna

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        408 non-null    int64
 1   Month             408 non-null    int64
 2   Starting Balance  408 non-null    float64
 3   Repayment         408 non-null    float64
 4   Interest Paid     408 non-null    float64
 5   Principal Paid    408 non-null    float64
 6   New Balance       408 non-null    float64
 7   interest_rate     408 non-null    float64
 8   car_type          408 non-null    object
dtypes: float64(6), int64(2), object(1)
memory usage: 28.8+ KB

In [42]:
Month = df.loc[:, 'Month'].values
Interest_paid = df.loc[:, 'Interest Paid'].values
Principal_paid = df.loc[:, 'Principal Paid'].values

In [ ]:
Month

In [43]:
## the value attribute convert a column of vale to numpy array
type(Month)

numpy.ndarray

In [ ]:
help(plt)

In [84]:
## plot month and interest paid as x and y axis
import matplotlib as plt

In [86]:
plt.plot(Month, interest Paid)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3053548759.py, line 1)